Repository: coffee2code/restrict-usernames
Catalog: lang/*.po
Languages: ru_ru

source: Invalid file specified for C2C_Plugin: %s
ru_ru: Указан неверный файл для C2C_Plugin: %s

source: Cheatin&#8217; huh?
ru_ru: Хакер, что ли?

source: See the "Help" link to the top-right of the page for more help.
ru_ru: Ссылка «Помощь» в правом верхнем углу для дополнительной информации.

source: Settings reset.
ru_ru: Настройки сброшены.

source: A value is required for: "%s"
ru_ru: Требуется значение для: «%s»

source: Expected integer value for: %s
ru_ru: Ожидалось целочисленное значение для %s

source: More information about %1$s %2$s
ru_ru: Больше информации о %1$s %2$s

source: Click for more help on this plugin
ru_ru: Больше информации об этом плагине

source: (especially check out the "Other Notes" tab, if present)
ru_ru: (обязательно проверьте вкладку «Примечания», если она есть)

source: More Help
ru_ru: Дополнительная помощь

source: Settings
ru_ru: Настройки

source: Donation for coffee2code plugin: %s
ru_ru: Пожертвование для плагина coffee2code: %s

source: Coffee fuels my coding.
ru_ru: Кофе усиливает мои навыки программирования.

source: A plugin by coffee2code
ru_ru: Плагин от coffee2code

source: Save Changes
ru_ru: Сохранить изменения

source: Reset Settings
ru_ru: Сбросить настройки

source: Scott Reilly, aka coffee2code
ru_ru: Scott Reilly или coffee2code

source: This plugin brought to you by %s.
ru_ru: %s купил этот плагин для вас.

source: Please consider a donation
ru_ru: Пожалуйста, подумайте о пожертвовании

source: Did you find this plugin useful?
ru_ru: Считаете этот плагин полезным?

source: Restrict Usernames
ru_ru: Ограничения для имен пользователей

source: Name Restrictions
ru_ru: Ограничения

source: Don't allow spaces in usernames.
ru_ru: Запретить использовать пробелы в именах пользователей.

source: WordPress (single-site, not multisite) allows spaces in usernames. Check this if you don't want to allow spaces.
ru_ru: WordPress в режиме одиночного сайта, в отличие от режима Multisite, разрешает использовать пробелы в именах пользователей. Поставьте галочку, если вы не хотите, чтобы в именах пользователей можно было использовать пробелы.

source: Minimum length
ru_ru: Минимальная длина

source: Enter the mimimum number of characters that can be used in a username. Leave blank or 0 to have no limit.
ru_ru: Минимальное число символов в имени пользователя. Оставьте поле пустым или укажите 0, чтобы снять ограничение.

source: Under BuddyPress, the minimum length is 4, which cannot be made any lower with this plugin.
ru_ru: Если вы используете BuddyPress, то минимальная длина составляет 4 символа. Это значение нельзя сделать меньше с помощью данного плагина.

source: Maximum length
ru_ru: Максимальная длина

source: Enter the maximum number of characters that can be used in a username. Leave blank or 0 to have no limit.
ru_ru: Максимальное число символов в имени пользователя. Оставьте поле пустым или укажите 0, чтобы снять ограничение.

source: Restricted usernames
ru_ru: Запрещенные имена пользователей

source: List the usernames that newly-registering users cannot use. Define one per line and use all lowercase.
ru_ru: Список имен пользователей, которые не могут быть использованы при регистрации новых аккаунтов. Указывайте каждое имя пользователя на отдельной строчке и используйте буквы в нижнем регистре (строчные).

source: Restricted usernames (partial matching)
ru_ru: Запрещенные имена пользователей (частичное совпадение)

source: These are partial text values that cannot appear in usernames requested by newly-registering users. Useful to prevent usage of bad language or prevent users from using a notation used to identify admins of the site, i.e. "admin_". Be aware that anything listed here will then not be allowed as any part of a username. Define one per line and use all lowercase.
ru_ru: Эти значения не могут содержаться в именах пользователей при регистрации новых аккаунтов. Полезно для фильтрации матных слов или запрета имен пользователей, в которых есть слово «admin». Имена пользователей, в которых содержится хотя бы одно из значений, будут недоступны для регистрации. Указывайте каждое значение на отдельной строчке и используйте буквы в нижнем регистре (строчные).

source: <strong>NOTE: Multisite only allows numbers and lowercase letters in usernames.</strong>
ru_ru: <strong>Примечание: Multisite разрешает использовать только цифры и буквы в нижнем регистре (строчные) в именах пользователей.</strong>

source: Required username substring
ru_ru: Обязательная подстрока в имени пользователя

source: These are partial text values, one of which MUST appear in any username requested by newly-registering users. Useful to force users to include some sort of identifier in their username, like "support_" (leading to "support_john") or "admin_" ("admin_steve"), etc. A username needs to only include ONE of the listed partials. Prepend a partial with "^" (i.e. "^support_" to require that partial as the start of a username) or end with "^" to require that partial be at the end (i.e. "_support^"). Without use of "^", the partial can appear in any position in the username. Be aware that this plugin does not convey to the user what these requirements are, it only enforces the requirement. Define one per line and use all lowercase.
ru_ru: Хотя бы одно из этих значений должно содержаться в имени пользователя при регистрации. Пригодится, если в имени пользователя должен быть некий идентификатор, например, «suppot_» (support_john) или «admin_» (admin_steve). Используйте символ «^», например, «^support_», чтобы указать, что значение должно быть в самом начале или «_support^», чтобы указать, что значение должно быть в самом конце. Если символа «^» нет, то значение может быть в любом месте имени пользователя.Имейте ввиду, что на странице регистрации плагин не сообщает какие именно имена пользователей можно использовать, он лишь проверяет их и выдает ошибку, если имя пользователя не подходит.Указывайте каждое значение на отдельной строчке и используйте буквы в нижнем регистре (строчные).

source: Restrict Usernames Settings
ru_ru: Настройки ограничений имен пользователей

source: NOTE: This plugin does not put any restrictions on usernames that the admin chooses for users when creating user accounts from within the WordPress admin. This only restricts the names that users choose when registering themselves for the site.
ru_ru: Примечание. Плагин не накладывает каких-либо ограничений на имена пользователей, когда администратор создает аккаунт в разделе «Пользователи».

source: Use the <a href="#username_check">namecheck tool</a> found below to test how the plugin would evaluate sample usernames.
ru_ru: Воспользуйтесь <a href="#username_check">инструментом проверки имен пользователей</a> размещенном внизу страницы, чтобы проверить, как плагин отреагирует на имена пользователей.

source: About
ru_ru: Обзор

source: If open registration is enabled for your site (via Settings &rarr; General &rarr; Membership ("Anyone can register")), WordPress allows visitors to register for an account on your blog. By default, any username they choose is allowed so long as it isn't an already existing account and it doesn't include invalid (i.e. non-alphanumeric) characters. This plugin allows you to add further restrictions.
ru_ru: Если открытая регистрация включена (Настройки &rarr; Общие &rarr; Членство. Любой может зарегистрироваться), WordPress позволяет посетителям создавать аккаунты на вашем блоге. По умолчанию разрешены любые имена пользователей, какими бы длинными они не былы, если только оно не занято кем-то другим или содержит что-то кроме букв и цифр. Данный плагин позволяет добавить некоторые ограничения на имена пользователей.

source: Possible reasons for wanting to restrict certain usernames:
ru_ru: Плагин может пригодится для следующих задач:

source: Prevent usernames that contain foul, offensive, or otherwise undesired words
ru_ru: Предотвратить использование нецензурных, оскорбительных или каких-то других нежелательных слов.

source: Prevent squatting on usernames that you may want to use in the future (but don't want to actually create the account for just yet) (essentially placing a hold on the username)
ru_ru: Предотвратить захват красивых имен пользователей, которые сейчас не нужны, но могут понадобится в будущем.

source: Prevent official-sounding usernames from being used (i.e. help, support, pr, info)
ru_ru: Запретить регистрацию «официальных» имен пользователей, например, admin, support, info, help и т. п.

source: Prevent official username syntax from being used (i.e. if all of your admins use a prefix to identify themselves, you don't want a visitor to use that prefix)
ru_ru: Запретить использовать обычным посетителям использовать какие-то префиксы в именах пользователей, которые используют только администраторы. Например, все администраторы используют имена вида admin_steve, а обычным пользователям нельзя создавать аккаунты с префиксом «admin_».

source: Prevent spaces from being used in a username (which WordPress allows by default)
ru_ru: Запретить использовать пробелы в именах пользователей (WordPress разрешает их по умолчанию).

source: Require that a username starts with, ends with, or contain one of a set of substrings (i.e. "support_", "admin_")
ru_ru: Имя пользователя обязательно должно начинаться с какого-то значения, содержать его или оканчиваться им (support_, admin_).

source: Require a minimum number of characters for usernames
ru_ru: Требовать минимальную длину имени пользователя.

source: Limit usernames to a maximum number of characters
ru_ru: Ограничить максимальную длину имени пользователя.

source: When attempting to register with a restricted username, the visitor will be given an error notice that says:
ru_ru: При попытке зарегистрироваться с именем пользователя, которое не подходит по заданным правилам, пользователь увидит ошибку:

source: Sorry, this username is invalid. Please choose another.
ru_ru: Извините, это имя пользователя не подходит. Выберите другое.

source: ERROR: This username is invalid. Please choose another.
ru_ru: Ошибка: имя пользователя не подходит. Выберите другое.

source: Advanced
ru_ru: Дополнительные возможности

source: <strong>ERROR</strong>: This username is invalid. Please choose another.
ru_ru: <strong>Ошибка:</strong> Имя пользователя не подходит. Выберите другое.

source: Results of username checks:
ru_ru: Результаты проверки имени пользователя:

source: valid
ru_ru: допустимо

source: invalid
ru_ru: недопустимо

source: Bear in mind that this only checks the syntax of the username against the rules and restrictions controlled below. It does not test additional criteria (such as if the username already exists) that WordPress also checks for on registration.
ru_ru: Плагин проверяет лишь правильность имен пользователей по указанным правилам и ограничениям. Дополнительные проверки, например «существует ли такое имя пользователя», которые WordPress делает при регистрации, здесь не производятся.

source: Test Usernames
ru_ru: Проверка имен пользователей

source: Use the input field below to list usernames you'd like to test against the plugin's restrictions. Separate multiple usernames with commas.
ru_ru: Введите имя пользователя, чтобы проверить подходит ли оно. Разделяйте имена запятыми.

source: Test
ru_ru: Проверить

source: Restrict the usernames that new users may use when registering for your site.
ru_ru: Установите ограничения для имен пользователей, которые можно использовать при регистрации новых аккаунтов на вашем сайте.

source: Scott Reilly
ru_ru: Скотт Рейли
